app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "i suck dick"], ["created_at", "2016-08-10 04:59:00.490581"], ["updated_at", "2016-08-10 04:59:00.490581"], ["user_id", 8]]
---
  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save